IMMZEK/msp-project/vasa/makedir/__programmer/deskdb/content/TICloudAgent/linux/ccs_base/common/targetdb/Modules/AM263/CONTROLSS_G0_EPWM26_CONTROLSS_G0_EPWM26.xml
	<register id="CONTROLSS_G0_EPWM26_XMINMAX_SHDW2" acronym="CONTROLSS_G0_EPWM26_XMINMAX_SHDW2" offset="0x744" width="32" description="XMINMAX Shadow 2 Register">
		<bitfield id="XMIN_SHDW2" width="16" begin="31" end="16" resetval="0x0" description="The value in the XMIN_SHDW2 register is loaded into XMIN_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XMAX_SHDW2" width="16" begin="15" end="0" resetval="0x0" description="The value in the XMAX_SHDW2 register is loaded into XMAX_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM26_XCMP1_SHDW3" acronym="CONTROLSS_G0_EPWM26_XCMP1_SHDW3" offset="0x780" width="32" description="Additional Compare 1 Shadow 3 Register">
		<bitfield id="XCMP1_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP1_SHDW3 Register The value in the XCMP1_SHDW3 register is loaded into XCMP1_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP1HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP1HR_SHDW3 Register  The value in the XCMP1HR_SHDW3 register is loaded into XCMP1HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM26_XCMP2_SHDW3" acronym="CONTROLSS_G0_EPWM26_XCMP2_SHDW3" offset="0x784" width="32" description="Additional Compare 2 Shadow 3 Register">
		<bitfield id="XCMP2_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP2_SHDW3 Register The value in the XCMP2_SHDW3 register is loaded into XCMP2_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP2HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP2HR_SHDW3 Register  The value in the XCMP2HR_SHDW3 register is loaded into XCMP2HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM26_XCMP3_SHDW3" acronym="CONTROLSS_G0_EPWM26_XCMP3_SHDW3" offset="0x788" width="32" description="Additional Compare 3 Shadow 3 Register">
		<bitfield id="XCMP3_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP3_SHDW3 Register The value in the XCMP3_SHDW3 register is loaded into XCMP3_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP3HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP3HR_SHDW3 Register  The value in the XCMP3HR_SHDW3 register is loaded into XCMP3HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM26_XCMP4_SHDW3" acronym="CONTROLSS_G0_EPWM26_XCMP4_SHDW3" offset="0x78C" width="32" description="Additional Compare 4 Shadow 3 Register">
		<bitfield id="XCMP4_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP4_SHDW3 Register The value in the XCMP4_SHDW3 register is loaded into XCMP4_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP4HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP4HR_SHDW3 Register  The value in the XCMP4HR_SHDW3 register is loaded into XCMP4HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM26_XCMP5_SHDW3" acronym="CONTROLSS_G0_EPWM26_XCMP5_SHDW3" offset="0x790" width="32" description="Additional Compare 5 Shadow 3 Register">
		<bitfield id="XCMP5_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP5_SHDW3 Register The value in the XCMP5_SHDW3 register is loaded into XCMP5_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP5HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP5HR_SHDW3 Register  The value in the XCMP5HR_SHDW3 register is loaded into XCMP5HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM26_XCMP6_SHDW3" acronym="CONTROLSS_G0_EPWM26_XCMP6_SHDW3" offset="0x794" width="32" description="Additional Compare 6 Shadow 3 Register">
		<bitfield id="XCMP6_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP6_SHDW3 Register The value in the XCMP6_SHDW3 register is loaded into XCMP6_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP6HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP6HR_SHDW3 Register  The value in the XCMP6HR_SHDW3 register is loaded into XCMP6HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM26_XCMP7_SHDW3" acronym="CONTROLSS_G0_EPWM26_XCMP7_SHDW3" offset="0x798" width="32" description="Additional Compare 7 Shadow 3 Register">
		<bitfield id="XCMP7_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP7_SHDW3 Register The value in the XCMP7_SHDW3 register is loaded into XCMP7_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP7HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP7HR_SHDW3 Register  The value in the XCMP7HR_SHDW3 register is loaded into XCMP7HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM26_XCMP8_SHDW3" acronym="CONTROLSS_G0_EPWM26_XCMP8_SHDW3" offset="0x79C" width="32" description="Additional Compare 8 Shadow 3 Register">
		<bitfield id="XCMP8_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="XCMP8_SHDW3 Register The value in the XCMP8_SHDW3 register is loaded into XCMP8_ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XCMP8HR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="XCMP8HR_SHDW3 Register  The value in the XCMP8HR_SHDW3 register is loaded into XCMP8HR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
	<register id="CONTROLSS_G0_EPWM26_XTBPRD_SHDW3" acronym="CONTROLSS_G0_EPWM26_XTBPRD_SHDW3" offset="0x7A0" width="32" description="Additional Time Base Period Shadow 3 Register">
		<bitfield id="XTBPRD_SHDW3" width="16" begin="31" end="16" resetval="0x0" description="The value in the XTBPRD_SHDW3 register is loaded into XTBPRD_ ACTIVE register when shadow to active load occurs." range="31 - 16" rwaccess="R/W"/> 
		<bitfield id="XTBPRDHR_SHDW3" width="16" begin="15" end="0" resetval="0x0" description="The value in the XTBPRDHR_SHDW3 register is loaded into XTBPRDHR_ACTIVE register when shadow to active load occurs." range="15 - 0" rwaccess="R/W"/>
	</register>
